days=int(input("За сколько дней тебе нужно прочитать книгу?:"))
pages=int(input("Кол-во страниц:"))
if pages >= 1000:
    print("ого,"+"желаю удачи")
infor=pages/days
print (f"нужно читать: {infor}")

print('| |');print('| |');print('| |');print('| |');print('| |');print('\_/')

print("А теперь посмотрим любопытный ты или нет,дальше поймешь")
films={ "число должно быть<=100!"+'смотри не ВВОДИ больше 100!!!!!!!'  }
print(films)

a=int(input('Введите число: '))
b="Надо было послушать!)"

if a <= 100:
    print('Молодец,что послушал')

if a >100:
    print("Ты точно этого хочешь???")
d=(input())
if  d=='нет':
     print("прощаю")
else :
    while a > 100:
        print(b)











